import random


class GameEngine:
    SCENES = {
        "start": {
            "text": "Добро пожаловать в Зону, сталкер. Введи своё имя:",
            "actions": []
        },
        "sidorovich": {
            "text": lambda user_name: (
                f" *Бункер Сидоровича*\n\n"
                f""
                f"Короче, Меченый, я тебя спас и в благородство играть не буду: выполнишь для меня пару заданий — и мы в расчете."
                f" Заодно посмотрим, как быстро у тебя башка после амнезии прояснится. \n\n"
                f"*Задание:*\n"
                f"Нужно принести кое-какие документы из лаборатории x18, что тебя там ждет я не знаю.\n"
                f"И вот что, будь осторожен\n\n"
                f"*Принеси документы*"
            ),
            "actions": ["shop", "give_doc", "street"]
        },
        "street": {
            "text": lambda user_name: (
                f"🌫️ *Улицы Припяти*\n\n"
                f"Вы вышли на улицу и оказались среди мёртвых домов. "
                f"Ветер шепчет старые секреты. Напротив — заброшенный дом, "
                f"где может быть ключ от лаборатории.\n\n"
                f"Вы видите ещё одного сталкера, сидящего у костра\n\n"
                f"*Куда пойдёшь?*"
            ),
            "actions": ["talk_stalker", "search_house", "lab_x18", "to_sidr"]
        },
        "house": {
            "text": "🏚️ *Заброшенный дом*\n\nВы в старом доме. Пахнет плесенью и пылью. Старая мебель разбросана по комнатам.\n\n*Что будешь делать?*",
            "actions": ["search", "back"]
        },
        "lab_x18": {
            "text": lambda user_name: (
                f"☢️ *Лаборатория X18*\n\n"
                f"Перед вами массивной дверью лаборатории. "
                f"На ней видны следы от пуль и царапины. "
                f"Табличка 'X18' едва читается под слоем ржавчины.\n\n"
            ),
            "actions": ["try_door", "back"]
        },
        "lab_x18_in": {
            "text": "Вы внутри лаборатории X18. Темно. В воздухе висит запах окисленного металла.  \n" 
                "Послышался шорох, возможно где-то рядом мутант...\n"
                "Ты увидел вдали комнату, в которой мерцает свет от ламп.\n"
                "Там могут быть мутанты, а без оружия их не одолеть\n\n"
                "*Решишься ли ты идти туда?*",
            "actions": ["go_room", "back"]
        },
        "shop": {
            "text": lambda user_name: (
                f"*Магазин*\n\n"
                f"'{random.choice([
                    f'Ну! Чё стоишь? Подходи, не кусаюсь',
                    f'Эй! Иди сюда, подкину тебе кое-чего!',
                    f'Здарова, рад тебя видеть! Ну чё, давай о деле поговорим?'
                ])}"
            ),
            "actions": ["buy", "back"]
        },
        "room": {
            "text": "",
            "actions": ["search_doc", "back"]
        },

        "end": {
            "text": "",
            "actions": ["menu", "back"]
        }

    }

    ITEMS = {
        "key_x18": {
            "name": "🔑 Ключ от X18",
            "description": "Ржавый ключ с гравировкой 'X18'"
        },
        "pistol": {
            "name": " Пистолет ПМ",
            "description": "9-мм пистолет, не самый мощный, но лучше, чем ничего",
            "price": 1000
        },
        "documents": {
            "name": " Документы X18",
            "description": "Запечатанная папка с грифом 'Совершенно секретно'"
        }
    }

    SIDOROVICH_SHOP = {
        "pistol": 1000
    }

    @staticmethod
    def get_scene_text(scene_id, user_name=""):
        scene = GameEngine.SCENES.get(scene_id, {})
        text_template = scene.get("text", "Сцена не найдена.")

        # Если текст - функция, вызываем её с именем
        if callable(text_template):
            return text_template(user_name or "Сталкер")
        return text_template

    @staticmethod
    def get_scene_actions(scene_id):
        return GameEngine.SCENES.get(scene_id, {}).get("actions", [])